{"August 6": ["Fall tuition and fees due."], "August 27": ["Official date of August graduation; diplomas mailed to students after final clearance is completed in September. Degree recipients may take part in the May 2022Commencement ceremony.", "Residence dining halls open with dinner. Residence halls and apartments open for upperclass and new graduate students."], "August 30": ["Fall 2021 semester classes begin."], "September 6": ["Labor Day - no classes."], "September 7": ["Classes resume. Follow a Monday schedule."], "September 13": ["Last day for graduate and undergraduate students to add courses, change sections or to put courses on audit. Deadline for completion of NE/Igrade expectations related toSpring 2021courses."], "September 17": ["Nomination of Masters Thesis Committee forms due to the Office of Graduate Education for December graduates."], "October 8": ["Last day to file an online degree application via SIS for December 31, 2021graduation."], "October 8 - October 9": ["Reunion andHomecoming 2021."], "October 11": ["Columbus Day - no classes."], "October 12": ["Classes resume."], "October 22": ["Last day for undergraduate and graduate students to drop a course."], "October 25- November 5": ["Consultation weeks.Advisement for Spring 2022registration. Students should consult with their faculty advisers."], "October 29": ["Doctoral dissertations due to advisers."], "November 5": ["Masters thesis and Engineering projects due to advisors."], "November 8- November 22": ["Pre-registration for the Spring 2022semester opens for currently enrolled students."], "November 12": ["Last day for undergraduates to add or remove Pass/No Credit designation."], "November 15": ["Masters theses due in the Office of Graduate Education. Last day to defend doctoral dissertations."], "November 24- November 26": ["Thanksgiving break - no classes. Dining halls closed."], "November 28": ["Dining halls reopen for dinner."], "November 29": ["Classes resume. Doctoral dissertations due in the Office of Graduate Education."], "December 10": ["Last day of classes. Deadline for completion of NE/I grade expectations related to Summer 2021 courses."], "December 11- December 14": ["Reading/Study days. Instructors can schedule no exams nor require any student work expectations on these days."], "December 15 - December 21": ["Final Examinations."], "December 15": ["Registration add/drop reopens for the Spring 2022 term."], "December 25 - January 1": ["Holiday winter break, Institute is closed."], "December 31": ["Official date of December graduation; diplomas mailed to students after final clearance is completed in January. Degree recipients may take part in the May 2022Commencement ceremony."]}