{"": ["Spring Term 2022\nJanuary 7\nSpring 2022 tuition and fees due\nJanuary 9\r\n\t\t\tResidence dining halls with dinner.\nJanuary 10\r\n\t\t\tSpring 2022 semester classes begin.\nJanuary 17\r\n\t\t\tMartin Luther King Jr. Day - no classes.\nJanuary 21\r\n\t\t\tLast day for graduate and undergraduate students to add courses, change sections, or to put courses onaudit.\nFebruary 4\nNomination of Masters Thesis Committee forms due to the Office of Graduate Education for May 2022 graduates.\nFebruary 21\r\n\t\t\tPresidents Day - no classes.\nFebruary 22\r\n\t\t\tClasses resume. Follow a Monday schedule.\nFebruary 28\nDoctoral dissertations due to advisers. Masters theses and Engineering projects due to advisers.\n\nFebruary 28 - March 18\nConsultation weeks. Advisement for Fall 2022registration. Students should consult with their faculty advisers.\n\nMarch 4\r\n\t\t\tLast day to file a Degree Application online via SIS for May 2022graduation.\n\n\nMarch 4\nLast day for undergraduate and graduate students to drop a course. Resident dining halls close after dinner."], "March 7": ["Registration begins for The Arch summer classes"], "March 7 - March 11": ["Spring Break"], "March 13": ["Resident dining halls reopen for dinner."], "March 14": ["Classes resume."], "March 21- March 25": ["Grand Marshal Week (Student Government Elections)."], "March 21- April 4": ["Pre-registration for the Fall 2022 semester opens for all currently enrolled students."], "March 23": ["GM week events - no classes."], "March 25": ["Last day to defend doctoral dissertations. Masters theses due in the Office of Graduate Education."], "April 8": ["Doctoral dissertations due in the Office of Graduate Education."], "April 15": ["Last day for undergraduates to add or remove Pass/No Credit designation."], "April 22": ["Summer Arch tuition and fees due."], "April 27": ["Last day of classes.Deadline for completion of NE/I grade expectations related to Fall2021 courses."], "April 28 - May 1": ["Reading/Study days. Instructors can schedule no exams nor require any student work expectations on these days.."], "May 2- May 6": ["Final Examinations"], "May 6": ["All resident dining halls close after dinner. Residence halls and apartments close at noon for all students not participating in Commencement."], "May 20": ["ROTC Commissioning Ceremony."], "May 21": ["Commencement."], "May 23\nSummer I and II classes begin (including The Arch classes).\n \nMay 30": ["Memorial Day - no classes."]}